---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.VRFLoopId
source: html/a24286dd-bf72-9135-2b32-386bd90e1d8b.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.VRFLoopId Property

The Varible Refrigerant Flow loop for the VRF fan coil equipment type.

## Syntax (C#)
```csharp
public ElementId VRFLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null